// Вывести на экран числа от 1 до 10
for (int i=0; i <= 10; i++)
{
   System.Console.WriteLine(i);
}